Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator class defines a manipulator to display and manipulate any text.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator.#ctor(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext,Tekla.Structures.Geometry3d.LineSegment,System.String)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator class.
manipulationContext: The manipulation context.
placement: The placement of the text manipulator.
initialText: The initial text to display.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator.TextEntered
Invoked when a text has been entered.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator.TextValue
Gets or sets the text value.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator.AttachHandlers


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator.DetachHandlers


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.TextManipulator.OnTextEntered(System.Object,System.String)
Event handler for the text entered event.
sender: The sender object.
eventArgs: The event arguments.